---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureVRepeat
source: html/073a73a6-c221-8150-6a40-dba8677d1b79.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureVRepeat Property

The property labeled "V Repeat" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureVRepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".